app/serializers/city_serializer.rb

SELECT "parks".* FROM "parks" WHERE "parks"."city_id" = $1  [["city_id", 1]]
---
    attributes :name, :state

    attribute :parks do |city|
        city.parks.map do |park|

SELECT "climbing_gyms".* FROM "climbing_gyms" WHERE "climbing_gyms"."city_id" = $1  [["city_id", 1]]
---
  end

    attribute :climbing_gyms do |city|
        city.climbing_gyms.map do |cg|

SELECT "reis".* FROM "reis" WHERE "reis"."city_id" = $1  [["city_id", 1]]
---


    attribute :reis do |city|
        city.reis.map do |rei|