app/controllers/api/v1/climbing_gyms_controller.rb

SELECT "climbing_gyms".* FROM "climbing_gyms"
---
    def index
        @climbing_gyms = ClimbingGym.all