app/controllers/api/v1/parks_controller.rb

SELECT "parks".* FROM "parks"
---
    def index
        @parks = Park.all