app/controllers/api/v1/sessions_controller.rb

    def create
        byebug
        @user = User.find_by(username: params[:session][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", ""], ["LIMIT", 1]]